console.log(`Оцениваю свою работу на 60 баллов
1. Вёрстка +10
- реализован интерфейс игры +5
- в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5
2. Логика игры. Ходы, перемещения фигур, другие действия игрока подчиняются определённым свойственным игре правилам +10
3. Реализовано завершение игры при достижении игровой цели +10
4. По окончанию игры выводится её результат, например, количество ходов, время игры, набранные баллы, выигрыш или поражение и т.д +10
5. Есть таблица результатов, в которой сохраняются результаты 10 игр с наибольшим счетом (лучшим временем и т.п.) или просто 10 последних игр (хранится в local storage) +10
6. Анимации или звуки, или настройки игры. Баллы начисляются за любой из перечисленных пунктов +10 (реализовано включение / выключение фоновой музыки)
7. Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10
высокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо
Заметила, что в демо тетрис не всегда удобно управлять фигурами (например они резко неуправляемо падали при чуть дольшем нажатии клавиши ArrowDown),
старалась максимально удобно сделать для пользователя, добавила расслабляющую музыку на фоне, которую можно включить/выключить, добавлен favicon.ico
`);